app/views/recipes/index.html.erb

SELECT "items".* FROM "items" WHERE "items"."recipe_id" = ?  [["recipe_id", 1]]
---
    <td><%= recipe.serves %></td>
    <% recipe.items.each do |item| %>