app/views/recipes/show.html.erb

  <ul>
    <% @recipe.items.each do |item| %>
---
SELECT "items".* FROM "items" WHERE "items"."recipe_id" = ?  [["recipe_id", 3]]