app/views/users/show.html.erb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "recipes" WHERE "recipes"."user_id" = ?  [["user_id", 1]]
---
<p><%= link_to 'Add a new recipe', new_recipe_path %></p>
<% if @user.recipes.size > 0 %>