app/views/ingredients/_display.html.erb

SELECT "recipes".* FROM "recipes" INNER JOIN "items" ON "recipes"."id" = "items"."recipe_id" WHERE "items"."ingredient_id" = ?  [["ingredient_id", 2]]
---
<b>Used in:</b>
<% @ingredient.recipes.each do |recipe| %>