app/views/ingredients/index.html.erb

    <% if ingredient.name != "" %>
      <p><%= link_to ingredient.name.capitalize + " is used in #{ingredient.recipes.size} recipes", ingredient_path(ingredient)%></p>
---
SELECT COUNT(*) FROM "recipes" INNER JOIN "items" ON "recipes"."id" = "items"."recipe_id" WHERE "items"."ingredient_id" = ?  [["ingredient_id", 1]]