app/controllers/ingredients_controller.rb

SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @ingredient = Ingredient.find(params[:id])

SELECT "ingredients".* FROM "ingredients"
---
  def index
#    if params[:user_id]
#      @user = User.find(params[:user_id])
#      @ingredients = @user.ingredients
#    else
      @ingredients = Ingredient.all