app/controllers/recipes_controller.rb

  def index
    if params[:user_id]
      @user = User.find(params[:user_id])
      @recipes = @user.recipes
    else
      @recipes = Recipe.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = ?  [["user_id", 1]]

  def create
    @recipe = Recipe.new(recipe_params)
    if @recipe.has_name?
      @recipe.user_id = current_user.id
      if @recipe.items.first.has_ingredient_name? #recipes need at least 1 ingredient
        @recipe.items.each do |item|
          if item.is_valid_or_blank?
            item.find_or_create_ingredient
          else
            flash.now[:notice] = 'Unable to create recipe - ingredient items need a quantity and an ingredient'
            render :new and return
          end
        end
      else
        flash.now[:notice] = 'Unable to create recipe - make sure to include at least one ingredient'
        render :new and return
      end
    else
      flash.now[:notice] = 'Unable to create recipe - needs a name'
      render :new and return
    end
    if @recipe.save
---
SELECT  "recipes".* FROM "recipes" ORDER BY "recipes"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."name" = ? LIMIT ?  [["name", "egg"], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."ingredient_id" = ?  [["ingredient_id", 6]]
SELECT "items".* FROM "items" WHERE "items"."recipe_id" = ? AND "items"."id" IN (?, ?, ?, ?, ?)  [["recipe_id", 6], ["id", 26], ["id", 27], ["id", 28], ["id", 29], ["id", 30]]
INSERT INTO "items" ("recipe_id", "quantity", "unit", "ingredient_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["recipe_id", 1], ["quantity", "2"], ["unit", ""], ["ingredient_name", "eggs"], ["created_at", "2018-08-31 01:37:56.143860"], ["updated_at", "2018-08-31 01:37:56.143860"]]
INSERT INTO "ingredients" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "egg"], ["created_at", "2018-08-31 01:37:56.186950"], ["updated_at", "2018-08-31 01:37:56.186950"]]
INSERT INTO "items" ("recipe_id", "quantity", "unit", "ingredient_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["recipe_id", 5], ["quantity", "1"], ["unit", ""], ["ingredient_name", ""], ["created_at", "2018-09-07 07:48:24.534546"], ["updated_at", "2018-09-07 07:48:24.534546"]]
INSERT INTO "recipes" ("name", "comments", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", ""], ["comments", ""], ["user_id", 1], ["created_at", "2018-09-07 07:48:24.532826"], ["updated_at", "2018-09-07 07:48:24.532826"]]

  def update
    if @recipe.has_name? && @recipe.items.first.has_ingredient_name? #recipes need these things
      if @recipe.update(recipe_params)
---
SELECT "items".* FROM "items" WHERE "items"."recipe_id" = ? AND "items"."id" IN (?, ?, ?, ?, ?)  [["recipe_id", 8], ["id", 36], ["id", 37], ["id", 38], ["id", 39], ["id", 40]]
UPDATE "items" SET "quantity" = ?, "unit" = ?, "ingredient_name" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["quantity", "1"], ["unit", "drop"], ["ingredient_name", "ketchup"], ["updated_at", "2018-09-12 17:58:30.146663"], ["id", 4]]
UPDATE "recipes" SET "name" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["name", ""], ["updated_at", "2018-09-07 09:48:07.003086"], ["id", 8]]