app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("name", "rating", "makes", "comments", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.user_id = current_user.id
    if @recipe.save