app/controllers/sessions_controller.rb

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "kylekinnear"], ["LIMIT", 1]]
---
  def create
    if auth_hash = request.env["omniauth.auth"]
      #binding.pry
      @user = User.find_or_create_by_omniauth(auth_hash)
      session[:user_id] = @user.id
      redirect_to root_path
    else
      @user = User.find_by(name: params[:user][:name])