app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Asd"], ["password_digest", "$2a$10$Xi8s/f1bjw9xo3Wcn8W2HuVJnASeqLT0/sETTZi/QbBeaxAhmoLj6"], ["created_at", "2018-08-31 00:11:17.675035"], ["updated_at", "2018-08-31 00:11:17.675035"]]

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$4DcYCJ/J8OVmYvxJ61eN0eAmk0myq9bkPNdnK.BtMPQP.T8cQlgyC"], ["updated_at", "2018-09-12 18:06:59.618635"], ["id", 2]]