app/models/ingredient.rb

  def self.most_used
    ranker = {}
    self.all.each do |i|
      if i.name != ""
        ranker.store(i, i.recipes.size)
---
SELECT "ingredients".* FROM "ingredients"
SELECT COUNT(*) FROM "recipes" INNER JOIN "items" ON "recipes"."id" = "items"."recipe_id" WHERE "items"."ingredient_id" = ?  [["ingredient_id", 1]]