app/models/item.rb

  def find_or_create_ingredient
    if self.ingredient_name
      self.ingredient = Ingredient.find_or_create_by(name: self.ingredient_name.downcase.singularize)
      self.ingredient_id = self.ingredient.id
      self.save
---
INSERT INTO "ingredients" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "flatbread"], ["created_at", "2018-08-31 02:13:58.782426"], ["updated_at", "2018-08-31 02:13:58.782426"]]
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."name" = ? LIMIT ?  [["name", "flatbread"], ["LIMIT", 1]]
INSERT INTO "items" ("recipe_id", "quantity", "unit", "ingredient_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["recipe_id", 5], ["quantity", "1214"], ["unit", "fds"], ["ingredient_name", "gfddsd"], ["created_at", "2018-08-31 02:55:37.914881"], ["updated_at", "2018-08-31 02:55:37.914881"]]
UPDATE "items" SET "ingredient_id" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["ingredient_id", 12], ["updated_at", "2018-08-31 02:55:37.927116"], ["id", 22]]