app/models/recipe.rb

  def has_an_ingredient?
    if self.items.first.ingredient_name.nil?
      errors.add(:items, "You need at least 1 ingredient")
    else
      unless !!(self.items.first.ingredient_name =~ /[a-zA-Z]/)
---
SELECT  "items".* FROM "items" WHERE "items"."recipe_id" = ? ORDER BY "items"."id" ASC LIMIT ?  [["recipe_id", 1], ["LIMIT", 1]]

  def self.highest_rated
    order(:rating).first
---
SELECT  "recipes".* FROM "recipes" ORDER BY "recipes"."rating" ASC LIMIT ?  [["LIMIT", 1]]